src/Documents/Приход/Приход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Приход</name>
  <registerRecords>AccumulationRegister.РН_МестаНакопленияДенег</registerRecords>
  <attributes>
    <name>ОтКого</name>
    <type>
      <types>CatalogRef.КонтрагентМесто</types>
      <types>CatalogRef.ФизЛица</types>
      <types>String</types>
      <types>CatalogRef.Люди</types>
      <types>CatalogRef.Семья</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияДС</name>
    <type>
      <types>CatalogRef.ИсточникХраненияДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаЧто</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/РН_МестаНакопленияДенег/РН_МестаНакопленияДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РН_МестаНакопленияДенег</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХраненияДС</name>
    <type>
      <types>CatalogRef.ИсточникХраненияДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтКогоКомуКуда</name>
    <type>
      <types>CatalogRef.КонтрагентМесто</types>
      <types>CatalogRef.ФизЛица</types>
      <types>String</types>
      <types>CatalogRef.Люди</types>
      <types>CatalogRef.Семья</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/Приход/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.РН_МестаНакопленияДенег.Записывать = Истина;
	Движение = Движения.РН_МестаНакопленияДенег.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.МестоХраненияДС = МестоХраненияДС;
	Движение.ОтКогоКомуКуда = ОтКого;
	Движение.Основание = ЗаЧто;
	//Движение.Пользователь = МестоХраненияДС.Владелец;
	Движение.Сумма = Сумма;
КонецПроцедуры
